fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаокончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//++Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  
	ЭлементыДляАбонентскихДоговоровСервер();
	//--Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата
КонецПроцедуры

//++Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  
&НаСервере
Процедура ЭлементыДляАбонентскихДоговоровСервер()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		Если Элементы.Найти("НачалоДействияДоговора")<> Неопределено Тогда
            Элементы.НачалоДействияДоговора.Видимость = Истина;
			Элементы.ОкончаниеДействияДоговора.Видимость = Истина;
			Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		Иначе	
			ПолеВвода = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
			
			ПолеВвода = Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора"; 
			
			ПолеВвода = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";   
			
			ПолеВвода = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
		КонецЕсли;
	Иначе
		Если Элементы.Найти("НачалоДействияДоговора")<> Неопределено Тогда
			Элементы.НачалоДействияДоговора.Видимость = Ложь;
			Элементы.ОкончаниеДействияДоговора.Видимость = Ложь;
			Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
			Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
//--Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//++Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата  
	ЭлементыДляАбонентскихДоговоровСервер();
	//--Незнамова МН: Добавление элементов формы для ВидаДоговора = АбонентскаяПлата
КонецПроцедуры
